routes_controller/app/controllers/users_controller.rb

INSERT INTO "users" ("name", "email", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "from_postman"], ["email", nil], ["created_at", "2022-11-10 00:32:30.457634"], ["updated_at", "2022-11-10 00:32:30.457634"]]
---
  def create
    # @user = User.new(user_params)
    # @user.save!
    # render json: @user
    # render json: params

    @user = User.new(user_params)
    if @user.save

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
UPDATE "users" SET "email" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["email", ""], ["updated_at", "2022-11-10 00:57:13.927561"], ["id", 1]]
---
  def update
    user = User.find_by(id: params[:id])

    if user.nil?
      render json: {message:"user not found"}, status: 422
    else
      if user&.update(user_params) # shorthand for if user.exist? & user.update(user_params)