art_share_api/app/controllers/artworks_controller.rb

  def update
    artwork = Artwork.find_by(id: params[:id])
    if artwork.nil?
      render json: {message: "artwotk not found"}, status: unprocessable_entity
    else
      if artwork&.update(artwork_param)
---
SELECT "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
UPDATE "artworks" SET "title" = $1, "updated_at" = $2 WHERE "artworks"."id" = $3  [["title", "postman_created_updated"], ["updated_at", "2022-11-10 19:29:10.492651"], ["id", 3]]

  def destroy
    artwork = Artwork.find(params[:id])
    if artwork.nil?
      render json: {message: "artwork not found"}, status: unprocessable_entity
    else
      if artwork.destroy
---
SELECT "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
DELETE FROM "artworks" WHERE "artworks"."id" = $1  [["id", 3]]

  def create
    artwork = Artwork.new(artwork_param)
    if artwork.nil?
      render json: {message: "artwork not created"}, status: 422
    else
      if artwork.save!
---
INSERT INTO "artworks" ("title", "image_url", "artist_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "postman_created"], ["image_url", "www.postman.com"], ["artist_id", 1], ["created_at", "2022-11-10 19:28:34.740780"], ["updated_at", "2022-11-10 19:28:34.740780"]]