art_share_api/app/controllers/artwork_shares_controller.rb

  def create
    artwork_share = ArtworkShare.new(artwork_share_params)
    if artwork_share.nil?
      render json: {message: "artwork share not created"}, status: 422
    else
      if artwork_share.save!
---
INSERT INTO "artwork_shares" ("artwork_id", "viewer_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["artwork_id", 4], ["viewer_id", 1], ["created_at", "2022-11-10 19:32:50.142633"], ["updated_at", "2022-11-10 19:32:50.142633"]]

  def show(id)
    artwork_share = ArtworkShare.find(id)
---
SELECT "artwork_shares".* FROM "artwork_shares" WHERE "artwork_shares"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]