art_share_api/app/controllers/comments_controller.rb

  def create
    comment = Comment.new(comment_params)
    if comment.nil?
      render json: {message: "comment not created"}, status: 422
    else
      if comment&.save!
---
INSERT INTO "comments" ("body", "commenter_id", "artwork_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["body", "great job"], ["commenter_id", 3], ["artwork_id", 2], ["created_at", "2022-11-10 22:04:19.996713"], ["updated_at", "2022-11-10 22:04:19.996713"]]

  def destroy
    comment = Comment.find(params[:id])
    if comment.nil?
      render json: {message: "comment not found"}, status: unprocessable_entity
    else
      if comment.destroy
---
SELECT "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
DELETE FROM "comments" WHERE "comments"."id" = $1  [["id", 3]]

  def show(id)
    comment = Comment.find(id)
---
SELECT "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]