art_share_api/app/controllers/users_controller.rb

  def index
    if params.has_key?(:username)
      user = User.find_by(username: params[:username])
      render json: user
    else
      users = User.all
---
SELECT "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "carrie"], ["LIMIT", 1]]
SELECT "users".* FROM "users"

  def update
    # user = User.find(params[:id])
    user = User.find_by(id: params[:id])
    if user.nil?
      render json: {message: "user not found"}, status: unprocessable_entity
    else
      if user&.update(user_params)
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
UPDATE "users" SET "username" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["username", "postman_created_patched"], ["updated_at", "2022-11-10 18:53:52.053215"], ["id", 5]]

  def destroy
    user = User.find(params[:id])
    if user.nil?
      render json: {message: "user not found"}, status: unprocessable_entity
    else
      if user.destroy
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
DELETE FROM "users" WHERE "users"."id" = $1  [["id", 5]]

  def create
    user = User.new(user_params)
    if user.nil?
      render json: {message: "user not created"}, status: 422
    else
      if user&.save!
---
INSERT INTO "users" ("username", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["username", "postman_created"], ["created_at", "2022-11-10 18:50:59.443357"], ["updated_at", "2022-11-10 18:50:59.443357"]]