art_share_api/app/models/artwork.rb

  def self.artworks_for_user_id(user_id)
    # User.find(user_id).artworks # user owned
    # User.find(user_id).shares # user shared
    artworks = User.find(user_id).artworks + User.find(user_id).shared_artworks
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]