art_share_api/app/models/comment.rb

  def self.show_comments_for_artwork(artwork_id)
    Artwork.find(artwork_id).comments
---
SELECT "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]

  def self.show_comments_for_commenter(commenter_id)
    User.find(commenter_id).comments
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]