art_share_api/app/models/user.rb

  def self.favourite_artworks_for_user(id)
    user = User.find(id).artworks.where('artworks.favourite = true')
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]